IDENTIFICATION DIVISION.
PROGRAM-ID. CFIVE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-A PIC 99 VALUE 12.
01 WS-B PIC 99 VALUE 10.
01 WS-C PIC 999 VALUE 13.
01 WS-D PIC 999 VALUE 16.
01 WS-E PIC 999 VALUE 20.
PROCEDURE DIVISION.
 ADD WS-A TO WS-B.
 DISPLAY "WS-B :" WS-B.
 ADD WS-A WS-B WS-C TO WS-D.
 DISPLAY "WS-D :" WS-D.
 ADD 15  WS-A WS-B TO WS-B.
 DISPLAY "NEW WS-B:" WS-B.
 ADD WS-A TO WS-B GIVING WS-C.
 DISPLAY "WS-C:" WS-C.
 ADD WS-A TO WS-B GIVING WS-C WS-D WS-E.
 DISPLAY "WS-E: " WS-E.
 DISPLAY "WS-D: " WS-D.
 DISPLAY "WS-C: " WS-C.
 STOP RUN.
