IDENTIFICATION DIVISION.
PROGRAM-ID. CTEN.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-CH PIC X(1).
01 WS-NAME PIC X(25).
01 WS-ISU PIC X(10).
PROCEDURE DIVISION.
A-PARA.
PERFORM B-PARA UNTIL WS-CH = 'N' OR 'n'. 
STOP RUN.
B-PARA.
DISPLAY "ENTER CHOICE (Y/N)"
ACCEPT WS-CH.
DISPLAY "ENTER NAME : ".
ACCEPT WS-NAME.
DISPLAY "ENTER ISU : ".
ACCEPT WS-ISU.
DISPLAY "NAME :" WS-NAME.
DISPLAY "ISU :" WS-ISU.

