IDENTIFICATION DIVISION.
PROGRAM-ID. CFIVE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-A PIC 99 VALUE 12.
01 WS-B PIC 99 VALUE 10.
01 WS-C PIC 999 VALUE 13.
01 WS-D PIC 999 VALUE 16.
01 WS-E PIC 999 VALUE 20.
PROCEDURE DIVISION.
 ADD WS-A TO WS-B.
 DISPLAY "WS-B :" WS-B.
 STOP RUN.
